In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [11]:
ser1 = Series(np.arange(8),index=[[1,1,2,2,3,3,4,4],['A','B','C','D','E','F','G','H']],)
ser1

1  A    0
   B    1
2  C    2
   D    3
3  E    4
   F    5
4  G    6
   H    7
dtype: int32

In [19]:
ser1.index.names=['Number','Letter']
ser1

Number  Letter
1       A         0
        B         1
2       C         2
        D         3
3       E         4
        F         5
4       G         6
        H         7
dtype: int32

In [26]:
df2 = ser1.unstack() # to create a dataframe from series. higher index will become index, lower index will become column name.
df2

Letter    A    B    C    D    E    F    G    H
Number
1       0.0  1.0  NaN  NaN  NaN  NaN  NaN  NaN
2       NaN  NaN  2.0  3.0  NaN  NaN  NaN  NaN
3       NaN  NaN  NaN  NaN  4.0  5.0  NaN  NaN
4       NaN  NaN  NaN  NaN  NaN  NaN  6.0  7.0

In [23]:
df1 = ser1.unstack('Number') # sets the upper index i.e number as the columns
df1

Number    1    2    3    4
Letter
A       0.0  NaN  NaN  NaN
B       1.0  NaN  NaN  NaN
C       NaN  2.0  NaN  NaN
D       NaN  3.0  NaN  NaN
E       NaN  NaN  4.0  NaN
F       NaN  NaN  5.0  NaN
G       NaN  NaN  NaN  6.0
H       NaN  NaN  NaN  7.0

In [24]:
df1.stack() # when we stack a dataframe with null values,the series formed will remove null values.

Letter  Number
A       1         0.0
B       1         1.0
C       2         2.0
D       2         3.0
E       3         4.0
F       3         5.0
G       4         6.0
H       4         7.0
dtype: float64

In [27]:
df2.stack() # when we stack a dataframe with null values,the series formed will remove null values.

Number  Letter
1       A         0.0
        B         1.0
2       C         2.0
        D         3.0
3       E         4.0
        F         5.0
4       G         6.0
        H         7.0
dtype: float64

In [28]:
df2.stack(dropna=False)

Number  Letter
1       A         0.0
        B         1.0
        C         NaN
        D         NaN
        E         NaN
        F         NaN
        G         NaN
        H         NaN
2       A         NaN
        B         NaN
        C         2.0
        D         3.0
        E         NaN
        F         NaN
        G         NaN
        H         NaN
3       A         NaN
        B         NaN
        C         NaN
        D         NaN
        E         4.0
        F         5.0
        G         NaN
        H         NaN
4       A         NaN
        B         NaN
        C         NaN
        D         NaN
        E         NaN
        F         NaN
        G         6.0
        H         7.0
dtype: float64